Rasnar/SmartCanton/dev/MKW41z/frdmkw41z_wireless_examples_bluetooth_heart_rate_sensor_freertos/framework/LowPower/Source/MKW41Z/PWR.c
        if(lpMode == 2)
        {
            PWRLib_MCU_Enter_LLS2();          
        }
        else
        {
            PWRLib_MCU_Enter_LLS3();          
        }
        
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);    
        BOARD_BLPItoBLPE();
    }
    
    if(gpfPWR_LowPowerExitCb != NULL)
    {
        gpfPWR_LowPowerExitCb();
    }
    
    PWRLib_LLWU_UpdateWakeupReason();
#if cPWR_BLE_LL_Enable        
    PWRLib_BLL_EnableInterrupts(bleEnabledInt); 
#endif       
    PWRLib_LPTMR_ClockStop();
    
    /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
    {
        uint64_t timerTicks;
        timerTicks = ((uint64_t)PWRLib_LPTMR_ClockCheck()*TMR_GetTimerFreq())/lptmrFreq;
        timerTicks += notCountedTicksBeforeSleep;
        TMR_SyncLpmTimers((uint32_t)timerTicks);
    }
#endif     
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_4
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_4)
static void PWR_HandleDeepSleepMode_4(void)
{
#if cPWR_BLE_LL_Enable
    uint16_t bleEnabledInt;
#endif  
    PWRLib_MCU_WakeupReason.AllBits = 0;  
    
#if cPWR_BLE_LL_Enable      
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) == 0)  /* BLL in DSM */
    {
        return;
    }
    
    bleEnabledInt = PWRLib_BLL_GetIntEn();
    PWRLib_BLL_ClearInterrupts(bleEnabledInt);    
    PWRLib_BLL_DisableInterrupts(bleEnabledInt);
#endif  
    
    if(gpfPWR_LowPowerEnterCb != NULL)
    {
        gpfPWR_LowPowerEnterCb();
    }
    
    {
        uint32_t rfOscEn;
        
        BOARD_BLPEtoBLPI();
        
        rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);
        
#if cPWR_DCDC_InBypass  
        PWRLib_MCU_Enter_VLLS0();
#else
        PWRLib_MCU_Enter_VLLS1();
#endif
        
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);    
        BOARD_BLPItoBLPE();
    }
    
    if(gpfPWR_LowPowerExitCb != NULL)
    {
        gpfPWR_LowPowerExitCb();
    }
    
#if cPWR_BLE_LL_Enable  
    PWRLib_BLL_EnableInterrupts(bleEnabledInt);        
#endif  
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_5
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_5)
static void PWR_HandleDeepSleepMode_5(void)
{
#if cPWR_BLE_LL_Enable
    uint16_t bleEnabledInt;
#endif
    PWRLib_MCU_WakeupReason.AllBits = 0;
    
#if cPWR_BLE_LL_Enable  
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) == 0)  /* BLL in DSM */
    {
        return;
    }
    
    bleEnabledInt = PWRLib_BLL_GetIntEn();
    PWRLib_BLL_ClearInterrupts(bleEnabledInt);    
    PWRLib_BLL_DisableInterrupts(bleEnabledInt);
#endif  
    
    if(gpfPWR_LowPowerEnterCb != NULL)
    {
        gpfPWR_LowPowerEnterCb();
    }
    
    {
        uint32_t rfOscEn;
        
        BOARD_BLPEtoBLPI();
        
        rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);
        
        PWRLib_MCU_Enter_VLLS2();  
        
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);    
        
        BOARD_BLPItoBLPE();
    }    
    
    if(gpfPWR_LowPowerExitCb != NULL)
    {
        gpfPWR_LowPowerExitCb();
    }
    
#if cPWR_BLE_LL_Enable  
    PWRLib_BLL_EnableInterrupts(bleEnabledInt);        
#endif  
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_6
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_6)
static void PWR_HandleDeepSleepMode_6(void)
{
    
#if (gTMR_EnableLowPowerTimers_d)   
    uint32_t notCountedTicksBeforeSleep = 0;
#endif  
    uint8_t clkMode;
    uint32_t lptmrTicks;
    uint32_t lptmrFreq;
    uint32_t sysTickCtrl;
    uint32_t sleepTimeMs;
    
    PWRLib_MCU_WakeupReason.AllBits = 0;  
    
#if cPWR_BLE_LL_Enable   
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) == 0)  /* BLL in DSM */
    {
        return;
    }
#endif  
    
#if (gTMR_EnableLowPowerTimers_d) && (cPWR_CheckLowPowerTimers)
    /* Get the expire time of the first programmed Low Power Timer */
    sleepTimeMs = TMR_GetFirstExpireTime(gTmrLowPowerTimer_c);
    
    if(mPWR_DeepSleepTimeMs < sleepTimeMs)
#endif
    {
        sleepTimeMs = mPWR_DeepSleepTimeMs;
    }
    
    PWRLib_LPTMR_GetTimeSettings(sleepTimeMs ,&clkMode ,&lptmrTicks, &lptmrFreq);
    PWRLib_LPTMR_ClockStart(clkMode,lptmrTicks);
    
#if (gTMR_EnableLowPowerTimers_d)
    /* If more low power timers are running, stop the hardware timer
     * and save the spend time in ticks that wasn't counted.  
     */
    notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif
    
    /* Disable SysTick counter and interrupt */
    sysTickCtrl = SysTick->CTRL & (SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
    SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
    
    {
        uint32_t rfOscEn = RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
        
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0x3);
        
        BOARD_BLPEtoBLPI();
        
        RSIM->CONTROL |= RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_MASK;
        SIM->FCFG1 |= SIM_FCFG1_FLASHDOZE_MASK;
        
        PWRLib_MCU_Enter_Stop();
        SIM->FCFG1 &= ~SIM_FCFG1_FLASHDOZE_MASK;  
        RSIM->CONTROL &= ~RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK; 
        BOARD_BLPItoBLPE();
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
    }
    
    /* Restore the state of SysTick */
    SysTick->CTRL |= sysTickCtrl;
    /* Checks sources of wakeup */
    PWRLib_StopUpdateWakeupReason();
    PWRLib_LPTMR_ClockStop();
    
    /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
    {
        uint64_t timerTicks;
        timerTicks = ((uint64_t)PWRLib_LPTMR_ClockCheck()*TMR_GetTimerFreq())/lptmrFreq;
        timerTicks += notCountedTicksBeforeSleep;
        TMR_SyncLpmTimers((uint32_t)timerTicks);
    }
#endif
}
#endif

